In [2]:
import pandas as pd
import os 
import csv

SyntaxError: invalid syntax (<ipython-input-17-3b478a6d42ca>, line 1)

In [3]:
american_emp = pd.read_csv("../Data/AirlineEmp/American.csv", header=[1], delimiter=",")
american_emp.set_index(["Month", "Year"])
american_emp

     Month  Year Full-time Part-time Grand Total
0        1  1990    68,137     9,039      77,176
1        2  1990    68,725     9,273      77,998
2        3  1990    69,509     9,376      78,885
3        4  1990    69,713     9,326      79,039
4        5  1990    70,376     9,309      79,685
..     ...   ...       ...       ...         ...
366      7  2020    95,792    11,236     107,028
367      8  2020    95,312    11,232     106,544
368      9  2020    95,197    10,973     106,170
369     10  2020    79,281    11,565      90,846
370     11  2020    78,761    11,613      90,374

[371 rows x 5 columns]

In [4]:
delta_emp = pd.read_csv("../Data/AirlineEmp/delta.csv", header=[1], delimiter=",")
delta_emp.set_index(["Month", "Year"])
delta_emp

     Month  Year Full-time Part-time Grand Total
0        1  1990    56,340     4,226      60,566
1        2  1990    56,413     4,184      60,597
2        3  1990    56,700     4,117      60,817
3        4  1990    56,630     4,112      60,742
4        5  1990    56,932     4,156      61,088
..     ...   ...       ...       ...         ...
366      7  2020    56,513     5,563      62,076
367      8  2020    57,630     5,716      63,346
368      9  2020    55,767     5,743      61,510
369     10  2020    55,384     5,845      61,229
370     11  2020    56,393     5,885      62,278

[371 rows x 5 columns]

In [5]:
JetBlue_emp = pd.read_csv("../Data/AirlineEmp/JetBlue.csv", header=[1], delimiter=",")
JetBlue_emp.set_index(["Month", "Year"])
JetBlue_emp

     Month  Year Full-time Part-time Grand Total
0        2  2000       275       175         450
1        3  2000       310       195         505
2        4  2000       360       210         570
3        5  2000       424       161         585
4        6  2000       452       176         628
..     ...   ...       ...       ...         ...
245      7  2020    16,389     5,028      21,417
246      8  2020    16,246     4,661      20,907
247      9  2020    15,735     3,913      19,648
248     10  2020    15,539     3,709      19,248
249     11  2020    15,464     3,650      19,114

[250 rows x 5 columns]

In [6]:
SouthWest_emp = pd.read_csv("../Data/AirlineEmp/SouthWest.csv", header=[1], delimiter=",")
SouthWest_emp.set_index(["Month", "Year"])
SouthWest_emp

     Month  Year Full-time Part-time Grand Total
0        1  1990     6,997       832       7,829
1        2  1990     6,996       833       7,829
2        3  1990     7,090       833       7,923
3        4  1990     7,772       173       7,945
4        5  1990     8,049       164       8,213
..     ...   ...       ...       ...         ...
366      7  2020    59,726     2,318      62,044
367      8  2020    59,355     2,333      61,688
368      9  2020    56,834     2,194      59,028
369     10  2020    55,992     2,142      58,134
370     11  2020    55,845     2,109      57,954

[371 rows x 5 columns]

In [7]:
United_emp = pd.read_csv("../Data/AirlineEmp/United.csv", header=[1], delimiter=",")
United_emp.set_index(["Month", "Year"])
United_emp

     Month  Year Full-time Part-time Grand Total
0        1  1990    65,664     5,457      71,121
1        2  1990    65,839     5,446      71,285
2        3  1990    66,070     5,445      71,515
3        4  1990    66,779     5,518      72,297
4        5  1990    67,217     5,675      72,892
..     ...   ...       ...       ...         ...
366      7  2020    71,580     7,229      78,809
367      8  2020    70,558     7,343      77,901
368      9  2020    70,310     6,911      77,221
369     10  2020    54,639     7,681      62,320
370     11  2020    54,411     7,871      62,282

[371 rows x 5 columns]

In [8]:
UA_emp = United_emp.loc[United_emp["Year"] > 2018]
UA_emp

     Month  Year Full-time Part-time Grand Total
348      1  2019    77,674    11,152      88,826
349      2  2019    77,959    11,092      89,051
350      3  2019    78,247    11,289      89,536
351      4  2019    78,521    11,575      90,096
352      5  2019    78,882    11,664      90,546
353      6  2019    79,178    11,674      90,852
354      7  2019    79,133    11,617      90,750
355      8  2019    79,171    11,533      90,704
356      9  2019    79,224    11,643      90,867
357     10  2019    79,342    11,767      91,109
358     11  2019    79,301    11,814      91,115
359     12  2019    79,745    11,701      91,446
360      1  2020    80,145    11,892      92,037
361      2  2020    80,362    11,887      92,249
362      3  2020    80,239    11,324      91,563
363      4  2020    78,370     8,999      87,369
364      5  2020    76,053     7,670      83,723
365      6  2020    74,779     7,449      82,228
366      7  2020    71,580     7,229      78,809
367      8  2020    70,558     7,343      77,901
368      9  2020    70,310     6,911      77,221
369     10  2020    54,639     7,681      62,320
370     11  2020    54,411     7,871      62,282

In [32]:
UA_emp19 = UA_emp.loc[UA_emp["Year"] == 2019]
UA_emp19 = UA_emp19[["Month", "Grand Total"]]
UA_emp19
UA_emp19 = UA_emp19.rename(columns={"Grand Total": "UA_emp_19"})
UA_emp19

     Month UA_emp_19
348      1    88,826
349      2    89,051
350      3    89,536
351      4    90,096
352      5    90,546
353      6    90,852
354      7    90,750
355      8    90,704
356      9    90,867
357     10    91,109
358     11    91,115
359     12    91,446

In [33]:
UA_emp20 = UA_emp.loc[UA_emp["Year"] == 2020]
UA_emp20 = UA_emp20[["Month", "Grand Total"]]
UA_emp20
UA_emp20 = UA_emp20.rename(columns={"Grand Total": "UA_emp_20"})
UA_emp20

     Month UA_emp_20
360      1    92,037
361      2    92,249
362      3    91,563
363      4    87,369
364      5    83,723
365      6    82,228
366      7    78,809
367      8    77,901
368      9    77,221
369     10    62,320
370     11    62,282

In [34]:
UA_emp_comb = UA_emp19.merge(UA_emp20, on="Month", how="left")
UA_emp_comb

    Month UA_emp_19 UA_emp_20
0       1    88,826    92,037
1       2    89,051    92,249
2       3    89,536    91,563
3       4    90,096    87,369
4       5    90,546    83,723
5       6    90,852    82,228
6       7    90,750    78,809
7       8    90,704    77,901
8       9    90,867    77,221
9      10    91,109    62,320
10     11    91,115    62,282
11     12    91,446       NaN

In [9]:
SW_emp = SouthWest_emp.loc[SouthWest_emp["Year"] > 2018]
SW_emp

     Month  Year Full-time Part-time Grand Total
348      1  2019    57,902     2,361      60,263
349      2  2019    58,156     2,292      60,448
350      3  2019    58,312     2,247      60,559
351      4  2019    58,474     2,255      60,729
352      5  2019    58,517     2,240      60,757
353      6  2019    58,698     2,190      60,888
354      7  2019    58,873     2,184      61,057
355      8  2019    59,053     2,235      61,288
356      9  2019    59,453     2,274      61,727
357     10  2019    59,657     2,308      61,965
358     11  2019    59,605     2,282      61,887
359     12  2019    59,629     2,276      61,905
360      1  2020    59,914     2,302      62,216
361      2  2020    60,092     2,344      62,436
362      3  2020    59,763     2,318      62,081
363      4  2020    59,866     2,325      62,191
364      5  2020    60,012     2,333      62,345
365      6  2020    59,947     2,341      62,288
366      7  2020    59,726     2,318      62,044
367      8  2020    59,355     2,333      61,688
368      9  2020    56,834     2,194      59,028
369     10  2020    55,992     2,142      58,134
370     11  2020    55,845     2,109      57,954

In [35]:
SW_emp19 = SW_emp.loc[SW_emp["Year"] == 2019]
SW_emp19 = SW_emp19[["Month", "Grand Total"]]
SW_emp19
SW_emp19 = SW_emp19.rename(columns={"Grand Total": "SW_emp_19"})
SW_emp19

     Month SW_emp_19
348      1    60,263
349      2    60,448
350      3    60,559
351      4    60,729
352      5    60,757
353      6    60,888
354      7    61,057
355      8    61,288
356      9    61,727
357     10    61,965
358     11    61,887
359     12    61,905

In [36]:
SW_emp20 = SW_emp.loc[SW_emp["Year"] == 2020]
SW_emp20 = SW_emp20[["Month", "Grand Total"]]
SW_emp20
SW_emp20 = SW_emp20.rename(columns={"Grand Total": "SW_emp_20"})
SW_emp20

     Month SW_emp_20
360      1    62,216
361      2    62,436
362      3    62,081
363      4    62,191
364      5    62,345
365      6    62,288
366      7    62,044
367      8    61,688
368      9    59,028
369     10    58,134
370     11    57,954

In [37]:
SW_emp_comb = SW_emp19.merge(SW_emp20, on="Month", how="left")
SW_emp_comb

    Month SW_emp_19 SW_emp_20
0       1    60,263    62,216
1       2    60,448    62,436
2       3    60,559    62,081
3       4    60,729    62,191
4       5    60,757    62,345
5       6    60,888    62,288
6       7    61,057    62,044
7       8    61,288    61,688
8       9    61,727    59,028
9      10    61,965    58,134
10     11    61,887    57,954
11     12    61,905       NaN

In [10]:
JB_emp = JetBlue_emp.loc[JetBlue_emp["Year"] > 2018]
JB_emp

     Month  Year Full-time Part-time Grand Total
227      1  2019    15,995     5,211      21,206
228      2  2019    16,079     5,254      21,333
229      3  2019    16,280     5,204      21,484
230      4  2019    16,398     5,206      21,604
231      5  2019    16,498     5,148      21,646
232      6  2019    16,642     5,099      21,741
233      7  2019    16,591     5,080      21,671
234      8  2019    16,602     5,032      21,634
235      9  2019    16,674     4,972      21,646
236     10  2019    16,751     4,930      21,681
237     11  2019    16,780     4,906      21,686
238     12  2019    16,648     4,851      21,499
239      1  2020    16,738     4,860      21,598
240      2  2020    16,856     4,865      21,721
241      3  2020    16,745     4,801      21,546
242      4  2020    16,756     4,778      21,534
243      5  2020    16,470     5,155      21,625
244      6  2020    16,418     5,138      21,556
245      7  2020    16,389     5,028      21,417
246      8  2020    16,246     4,661      20,907
247      9  2020    15,735     3,913      19,648
248     10  2020    15,539     3,709      19,248
249     11  2020    15,464     3,650      19,114

In [39]:
JB_emp19 = JB_emp.loc[JB_emp["Year"] == 2019]
JB_emp19 = JB_emp19[["Month", "Grand Total"]]
JB_emp19
JB_emp19 = JB_emp19.rename(columns={"Grand Total": "JB_emp_19"})
JB_emp19

     Month JB_emp_19
227      1    21,206
228      2    21,333
229      3    21,484
230      4    21,604
231      5    21,646
232      6    21,741
233      7    21,671
234      8    21,634
235      9    21,646
236     10    21,681
237     11    21,686
238     12    21,499

In [38]:
JB_emp20 = JB_emp.loc[JB_emp["Year"] == 2020]
JB_emp20 = JB_emp20[["Month", "Grand Total"]]
JB_emp20
JB_emp20 = JB_emp20.rename(columns={"Grand Total": "JB_emp_20"})
JB_emp20

     Month JB_emp_20
239      1    21,598
240      2    21,721
241      3    21,546
242      4    21,534
243      5    21,625
244      6    21,556
245      7    21,417
246      8    20,907
247      9    19,648
248     10    19,248
249     11    19,114

In [40]:
JB_emp_comb = JB_emp19.merge(JB_emp20, on="Month", how="left")
JB_emp_comb

    Month JB_emp_19 JB_emp_20
0       1    21,206    21,598
1       2    21,333    21,721
2       3    21,484    21,546
3       4    21,604    21,534
4       5    21,646    21,625
5       6    21,741    21,556
6       7    21,671    21,417
7       8    21,634    20,907
8       9    21,646    19,648
9      10    21,681    19,248
10     11    21,686    19,114
11     12    21,499       NaN

In [11]:
DA_emp = delta_emp.loc[delta_emp["Year"] > 2018]
DA_emp

     Month  Year Full-time Part-time Grand Total
348      1  2019    78,055    10,684      88,739
349      2  2019    78,645    10,846      89,491
350      3  2019    79,067    10,892      89,959
351      4  2019    79,307    10,660      89,967
352      5  2019    79,502    10,929      90,431
353      6  2019    79,601    11,688      91,289
354      7  2019    79,462    11,651      91,113
355      8  2019    79,502    11,192      90,694
356      9  2019    79,512    10,417      89,929
357     10  2019    79,931    10,371      90,302
358     11  2019    79,636    10,360      89,996
359     12  2019    79,841    10,565      90,406
360      1  2020    80,582    10,245      90,827
361      2  2020    81,177    10,239      91,416
362      3  2020    80,179     9,801      89,980
363      4  2020    57,498     4,512      62,010
364      5  2020    47,581     3,403      50,984
365      6  2020    47,877     3,591      51,468
366      7  2020    56,513     5,563      62,076
367      8  2020    57,630     5,716      63,346
368      9  2020    55,767     5,743      61,510
369     10  2020    55,384     5,845      61,229
370     11  2020    56,393     5,885      62,278

In [29]:
DA_emp19 = delta_emp.loc[delta_emp["Year"] == 2019]
DA_emp19
DA_emp19 = DA_emp19[["Month", "Grand Total"]]
DA_emp19 = DA_emp19.rename(columns={"Grand Total": "DA_emp_19"})
DA_emp19

     Month DA_emp_19
348      1    88,739
349      2    89,491
350      3    89,959
351      4    89,967
352      5    90,431
353      6    91,289
354      7    91,113
355      8    90,694
356      9    89,929
357     10    90,302
358     11    89,996
359     12    90,406

In [28]:
DA_emp20 = delta_emp.loc[delta_emp["Year"] == 2020]
DA_emp20
DA_emp20 = DA_emp20[["Month", "Grand Total"]]
DA_emp20 = DA_emp20.rename(columns={"Grand Total": "DA_emp_20"})
DA_emp20

     Month DA_emp_20
360      1    90,827
361      2    91,416
362      3    89,980
363      4    62,010
364      5    50,984
365      6    51,468
366      7    62,076
367      8    63,346
368      9    61,510
369     10    61,229
370     11    62,278

In [30]:
DA_emp_comb = DA_emp19.merge(DA_emp20, on="Month", how="left")
DA_emp_comb

    Month DA_emp_19 DA_emp_20
0       1    88,739    90,827
1       2    89,491    91,416
2       3    89,959    89,980
3       4    89,967    62,010
4       5    90,431    50,984
5       6    91,289    51,468
6       7    91,113    62,076
7       8    90,694    63,346
8       9    89,929    61,510
9      10    90,302    61,229
10     11    89,996    62,278
11     12    90,406       NaN

In [13]:
AA_emp = american_emp.loc[american_emp["Year"] > 2018]
AA_emp19 = american_emp.loc[american_emp["Year"] == 2019]

In [24]:
AA_emp19 = AA_emp19[["Month", "Grand Total"]]
AA_emp19
AA_emp19 = AA_emp19.rename(columns={"Grand Total": "AA_emp_19"})
AA_emp19

     Month AA_emp_19
348      1   106,799
349      2   106,701
350      3   107,272
351      4   107,531
352      5   107,773
353      6   108,107
354      7   107,818
355      8   106,976
356      9   106,981
357     10   107,430
358     11   107,124
359     12   107,381

In [23]:
AA_emp20 = american_emp.loc[american_emp["Year"]  == 2020]
AA_emp20 = AA_emp20[["Month", "Grand Total"]]
AA_emp20 = AA_emp20.rename(columns={"Grand Total": "AA_emp_20"})
AA_emp20

     Month AA_emp_20
360      1   107,452
361      2   107,905
362      3   109,108
363      4   108,579
364      5   107,346
365      6   107,252
366      7   107,028
367      8   106,544
368      9   106,170
369     10    90,846
370     11    90,374

In [27]:
AA_emp_comb = AA_emp19.merge(AA_emp20, on="Month", how="left")
AA_emp_comb

    Month AA_emp_19 AA_emp_20
0       1   106,799   107,452
1       2   106,701   107,905
2       3   107,272   109,108
3       4   107,531   108,579
4       5   107,773   107,346
5       6   108,107   107,252
6       7   107,818   107,028
7       8   106,976   106,544
8       9   106,981   106,170
9      10   107,430    90,846
10     11   107,124    90,374
11     12   107,381       NaN

In [44]:
emp_2020_comb = AA_emp20.merge(DA_emp20, on="Month", how="left")
emp_2020_comb = emp_2020_comb.merge(JB_emp20, on="Month", how="left")
emp_2020_comb = emp_2020_comb.merge(SW_emp20, on="Month", how="left")
emp_2020_comb = emp_2020_comb.merge(UA_emp20, on="Month", how="left")
emp_2020_comb

    Month AA_emp_20 DA_emp_20 JB_emp_20 SW_emp_20 UA_emp_20
0       1   107,452    90,827    21,598    62,216    92,037
1       2   107,905    91,416    21,721    62,436    92,249
2       3   109,108    89,980    21,546    62,081    91,563
3       4   108,579    62,010    21,534    62,191    87,369
4       5   107,346    50,984    21,625    62,345    83,723
5       6   107,252    51,468    21,556    62,288    82,228
6       7   107,028    62,076    21,417    62,044    78,809
7       8   106,544    63,346    20,907    61,688    77,901
8       9   106,170    61,510    19,648    59,028    77,221
9      10    90,846    61,229    19,248    58,134    62,320
10     11    90,374    62,278    19,114    57,954    62,282

    Month AA_emp_20 DA_emp_20 JB_emp_20 SW_emp_20 UA_emp_20
0       1   107,452    90,827    21,598    62,216    92,037
1       2   107,905    91,416    21,721    62,436    92,249
2       3   109,108    89,980    21,546    62,081    91,563
3       4   108,579    62,010    21,534    62,191    87,369
4       5   107,346    50,984    21,625    62,345    83,723
5       6   107,252    51,468    21,556    62,288    82,228
6       7   107,028    62,076    21,417    62,044    78,809
7       8   106,544    63,346    20,907    61,688    77,901
8       9   106,170    61,510    19,648    59,028    77,221
9      10    90,846    61,229    19,248    58,134    62,320
10     11    90,374    62,278    19,114    57,954    62,282

In [59]:
final_2020_emp.dtypes

Month         int64
AA_emp_20    object
DA_emp_20    object
JB_emp_20    object
SW_emp_20    object
UA_emp_20    object
dtype: object

In [63]:
final_2020_emp = emp_2020_comb.copy()
final_2020_emp.columns

Index(['Month', 'AA_emp_20', 'DA_emp_20', 'JB_emp_20', 'SW_emp_20',
       'UA_emp_20'],
      dtype='object')

In [64]:
final_2020_emp.to_csv('../Data/final_2020_emp.csv', index=False)